Revit 2027 API
ParameterTypeId.SketchingChain Property
 "Chain"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SketchingChain { get; }
Public Shared ReadOnly Property SketchingChain As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SketchingChain {
	ForgeTypeId^ get ();
}
static member SketchingChain : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace